{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_1","layers":[{"class_name":"Conv2D","config":{"filters":512,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D1","trainable":true,"batch_input_shape":[null,null,null,61],"dtype":"float32"}},{"class_name":"LeakyReLU","config":{"alpha":0.01,"name":"leaky_re_lu_LeakyReLU1","trainable":true}},{"class_name":"Conv2D","config":{"filters":384,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D2","trainable":true}},{"class_name":"LeakyReLU","config":{"alpha":0.01,"name":"leaky_re_lu_LeakyReLU2","trainable":true}},{"class_name":"Conv2D","config":{"filters":196,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D3","trainable":true}},{"class_name":"LeakyReLU","config":{"alpha":0.01,"name":"leaky_re_lu_LeakyReLU3","trainable":true}},{"class_name":"Conv2D","config":{"filters":96,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D4","trainable":true}},{"class_name":"LeakyReLU","config":{"alpha":0.01,"name":"leaky_re_lu_LeakyReLU4","trainable":true}},{"class_name":"Conv2D","config":{"filters":3,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D5","trainable":true}},{"class_name":"LeakyReLU","config":{"alpha":0.01,"name":"leaky_re_lu_LeakyReLU5","trainable":true}}]},"keras_version":"tfjs-layers 3.15.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"conv2d_Conv2D1/kernel","shape":[1,1,61,512],"dtype":"float32"},{"name":"conv2d_Conv2D1/bias","shape":[512],"dtype":"float32"},{"name":"conv2d_Conv2D2/kernel","shape":[1,1,512,384],"dtype":"float32"},{"name":"conv2d_Conv2D2/bias","shape":[384],"dtype":"float32"},{"name":"conv2d_Conv2D3/kernel","shape":[1,1,384,196],"dtype":"float32"},{"name":"conv2d_Conv2D3/bias","shape":[196],"dtype":"float32"},{"name":"conv2d_Conv2D4/kernel","shape":[1,1,196,96],"dtype":"float32"},{"name":"conv2d_Conv2D4/bias","shape":[96],"dtype":"float32"},{"name":"conv2d_Conv2D5/kernel","shape":[1,1,96,3],"dtype":"float32"},{"name":"conv2d_Conv2D5/bias","shape":[3],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.15.0","convertedBy":null}